#!/bin/bash

sqlite3 source.db <<EOF
.print 'Задание 1:'
SELECT "Группа товаров", Товар, MAX(Цена) AS "Максимальная цена" FROM Товары GROUP BY "Группа товаров";
.print ''
.print 'Задание 2:'
SELECT Категория, MIN("Количество товаров в категории") AS Количество 
                    FROM (SELECT Категория, COUNT(Категория) AS "Количество товаров в категории" 
                    FROM (SELECT Категории.Категория 
                    FROM Товары JOIN Категории ON Товары."Код категории"=Категории."Код категории")
                    GROUP BY Категория);
.print ''
.print 'Задание 3:'
SELECT Категория, MAX("Сумма стоимостей товаров") AS "Максимальная сумма" 
                    FROM (SELECT Категория, SUM(Цена) AS "Сумма стоимостей товаров" 
                    FROM (SELECT Цена, Категории.Категория 
                    FROM Товары JOIN Категории ON Товары."Код категории"=Категории."Код категории")
                    GROUP BY Категория);
EOF